<h1 style="font-size: 2.0em;">Random Sampling pada Pandas Data Frame</h1>

<h1 style="font-size: 1.6em;">Import modules</h1>

In [5]:
import pandas as pd

print(pd.__version__)

2.2.2

<h1 style="font-size: 1.6em;">Persiapan Data Frame</h1>

In [8]:
d = {'col_1':[1,2,3,4,5], 
     'col_2':[10,20,30,40,50]}
df = pd.DataFrame(d)
df

   col_1  col_2
0      1     10
1      2     20
2      3     30
3      4     40
4      5     50

<h1 style="font-size: 1.6em;">Random sampling with/without replacement</h1>

In [11]:
df.sample(n=4,replace=False,random_state=0)

   col_1  col_2
2      3     30
0      1     10
1      2     20
3      4     40

In [13]:
df.sample(n=4,replace=True,random_state=0)

   col_1  col_2
4      5     50
0      1     10
3      4     40
3      4     40